Manoharkuduchella/Manohar_BitLearn/Bitlearn_workspace/Microcontrollers/STM32/stm32l4_workspace_LL/03_stm32l4xx_drivers_all/Drivers/Src/stm32l476xx_spi2.c
/*
 * stm32l476xx_spi2.c
 *
 *  Created on: May 15, 2026
 *      Author: manohar kuduchella
 */

#include "stm32l476xx_spi2.h"

/* ================= CLOCK ================= */

void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDi) {
	if (EnOrDi == ENABLE) {
		if (pSPIx == SPI1)
			SPI1_PCLK_EN();
		else if (pSPIx == SPI2)
			SPI2_PCLK_EN();
		else if (pSPIx == SPI3)
			SPI3_PCLK_EN();
	} else {
		if (pSPIx == SPI1)
			SPI1_PCLK_DI();
		else if (pSPIx == SPI2)
			SPI2_PCLK_DI();
		else if (pSPIx == SPI3)
			SPI3_PCLK_DI();
	}
}

/* ================= INIT ================= */

void SPI_Init(SPI_Handle_t *pSPIHandle) {
	uint32_t temp = 0;

	SPI_PeriClockControl(pSPIHandle->pSPIx, ENABLE);

	/* -------- Device Mode -------- */
	temp |= (pSPIHandle->SPI_Config.DeviceMode << SPI_CR1_MSTR);

	/* -------- Bus Config -------- */
	if (pSPIHandle->SPI_Config.BusConfig == SPI_BUS_CONFIG_FD) {
		temp &= ~(1 << SPI_CR1_BIDIMODE);   // full
	} else if (pSPIHandle->SPI_Config.BusConfig == SPI_BUS_CONFIG_HD) {
		temp |= (1 << SPI_CR1_BIDIMODE);    // half
	} else if (pSPIHandle->SPI_Config.BusConfig == SPI_BUS_CONFIG_SIMPLEX_RXONLY) {
		temp &= ~(1 << SPI_CR1_BIDIMODE);   // 2-line
		temp |= (1 << SPI_CR1_RXONLY);     // RX only
	}

	/* -------- Baud Rate -------- */
	temp |= (pSPIHandle->SPI_Config.SclkSpeed << SPI_CR1_BR);

	/* -------- CPOL & CPHA -------- */
	temp |= (pSPIHandle->SPI_Config.CPOL << SPI_CR1_CPOL);
	temp |= (pSPIHandle->SPI_Config.CPHA << SPI_CR1_CPHA);

	/* -------- DFF -------- */
	/* -------- Data size (CR2 DS bits) -------- */
	pSPIHandle->pSPIx->CR2 &= ~(0xF << SPI_CR2_DS);

	if (pSPIHandle->SPI_Config.DFF == SPI_DFF_8BITS)
	{
		pSPIHandle->pSPIx->CR2 |= (7 << SPI_CR2_DS);   // 8-bit
		pSPIHandle->pSPIx->CR2 |= (1 << SPI_CR2_FRXTH);   // RXNE at 8-bit
	}
	else
	{
		pSPIHandle->pSPIx->CR2 |= (15 << SPI_CR2_DS);  // 16-bit
		pSPIHandle->pSPIx->CR2 &= ~(1 << SPI_CR2_FRXTH);  // RXNE at 16-bit
	}

	/* -------- SSM -------- */
	temp |= (pSPIHandle->SPI_Config.SSM << SPI_CR1_SSM);

	pSPIHandle->pSPIx->CR1 = temp;

	/* -------- SSI (must for master + SSM) -------- */
	if (pSPIHandle->SPI_Config.SSM == SPI_SSM_EN) {
		pSPIHandle->pSPIx->CR1 |= (1 << SPI_CR1_SSI);
		//pSPIHandle->pSPIx->CR2 |= (1 << SPI_CR2_NSSP);
	}

	/* -------- Enable SPI -------- */
	pSPIHandle->pSPIx->CR1 |= (1 << SPI_CR1_SPE);
}


/* ================= FLAG STATUS ================= */

uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName)
{
	if (pSPIx->SR & FlagName)
	{
		return SET;
	}

	return RESET;
}

uint8_t SPI_Transfer(SPI_RegDef_t *pSPIx, uint8_t data) {
	while (!(pSPIx->SR & SPI_TXE_FLAG))
		;
	pSPIx->DR = data;

	while (!(pSPIx->SR & SPI_RXNE_FLAG))
		;
	return pSPIx->DR;
}

void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t Len)
{
	while (Len > 0)
	{
		/* Wait until TXE = 1 */
		while ((pSPIx->SR & SPI_TXE_FLAG) == 0);

		/* 8-bit mode */
		if (((pSPIx->CR2 >> SPI_CR2_DS) & 0xF) == 0x7)
		{
			*((volatile uint8_t *)&pSPIx->DR) = *pTxBuffer;

			pTxBuffer++;
			Len--;
		}
		/* 16-bit mode */
		else if (((pSPIx->CR2 >> SPI_CR2_DS) & 0xF) == 0xF)
		{
			pSPIx->DR = *((uint16_t *)pTxBuffer);

			pTxBuffer += 2;
			Len -= 2;
		}
	}

	/* Wait BSY = 0 */
	while (pSPIx->SR & SPI_BUSY_FLAG);
}

void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len)
{
	while (Len > 0)
	{
		/* Wait TXE */
		while ((pSPIx->SR & SPI_TXE_FLAG) == 0);

		/* 8-bit mode */
		if (((pSPIx->CR2 >> SPI_CR2_DS) & 0xF) == 0x7)
		{
			*((volatile uint8_t*) &pSPIx->DR) = 0xFF;   // dummy byte

			while (!(pSPIx->SR & SPI_RXNE_FLAG))
				;

			*pRxBuffer = pSPIx->DR;

			pRxBuffer++;
			Len--;
		}
		/* 16-bit mode */
		else if (((pSPIx->CR2 >> SPI_CR2_DS) & 0xF) == 0xF)
		{
			pSPIx->DR = 0xFFFF;   // send dummy 16-bit

			while (!(pSPIx->SR & SPI_RXNE_FLAG))
				;

			*((uint16_t*) pRxBuffer) = pSPIx->DR;

			pRxBuffer += 2;
			Len -= 2;
		}
	}

	while (pSPIx->SR & SPI_BUSY_FLAG);
}
